RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/csdidac/cy_csdidac.c
/*******************************************************************************
* Function Name: Cy_CSDIDAC_Init
****************************************************************************//**
*
* Captures the CSD HW block and configures it to the default state.
* This function is called by the application program prior to calling
* any other middleware function.
*
* Initializes the CSDIDAC middleware. Acquires, locks, and initializes
* the CSD HW block by using the low-level CSD driver.
* The function performs the following tasks:
* * Verifies the input parameters. The CY_CSDIDAC_BAD_PARAM is returned if
*   verification fails.
* * Acquires and locks the CSD HW block for use of the CSDIDAC, if the CSD HW
*   block is in a free state.
* * If the CSD HW block is acquired, it is initialized with
*   the CSDIDAC middleware by the default configuration.
*   The output pins are not connected to the CSD HW block.
*   The outputs are disabled and CY_CSDIDAC_SUCCESS is returned.
*
* To connect an output pin and enable an output current, the
* Cy_CSDIDAC_OutputEnable() or Cy_CSDIDAC_OutputEnableExt() functions
* are used.
* If there is no CSD HW block, the CY_CSDIDAC_HW_BUSY status is returned,
* and the CSDIDAC middleware waits for the CSD HW block to be in the idle
* state to initialize.
*
* \param config
* The pointer to the configuration structure \ref cy_stc_csdidac_config_t that
* contains the CSDIDAC middleware initial configuration data generated
* by the CSD personality of the ModusToolbox Device Configurator tool.
*
* \param context
* The pointer to the CSDIDAC context structure \ref cy_stc_csdidac_context_t
* passed by the user. After the initialization, this structure contains
* both CSDIDAC configuration and internal data. It is used during the whole
* CSDIDAC operation.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS           - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM         - The input pointer is NULL or an invalid
*                                  parameter is passed.
* * CY_CSDIDAC_HW_LOCKED         - The CSD HW block is already in use by other
*                                  middleware.
* * CY_CSDIDAC_HW_FAILURE        - The CSD HW block failure.
* * CY_CSDIDAC_BAD_CONFIGURATION - The CSDIDAC configuration structure
*                                  initialization issue.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_Init(
                const cy_stc_csdidac_config_t * config,
                cy_stc_csdidac_context_t * context)
{
    cy_en_csdidac_status_t result = CY_CSDIDAC_BAD_PARAM;

    if ((NULL != config) && (NULL != context))
    {
        if(true == Cy_CSDIDAC_IsIdacConfigValid(config))
        {
            /* Copies the configuration structure to the context. */
            context->cfgCopy = *config;
            /* Captures the CSD HW block for the IDAC functionality. */
            result = Cy_CSDIDAC_Restore(context);
            if (CY_CSDIDAC_SUCCESS == result)
            {
                /* Disconnects all CSDIDAC channels. */
                Cy_CSDIDAC_DisconnectChannelA(context);
                Cy_CSDIDAC_DisconnectChannelB(context);
                /* Wakes up the CSD HW block. */
                (void)Cy_CSDIDAC_Wakeup(context);
            }
        }
        else
        {
            result = CY_CSDIDAC_BAD_CONFIGURATION;
        }
    }

    return (result);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_DeInit
****************************************************************************//**
*
* Stops the middleware operation and releases the CSD HW block.
*
* If any output channel is enabled, it will be disabled and disconnected.
*
* After the CSDIDAC middleware is stopped, the CSD HW block may be
* reconfigured by the application program or other middleware for any
* other usage.
*
* When the middleware operation is stopped by the Cy_CSDIDAC_DeInit()
* function, a subsequent call of the Cy_CSDIDAC_Init() function repeats the
* initialization process. However, to implement Time-multiplexed mode
* (sharing the CSD HW Block between multiple middleware),
* the Cy_CSDIDAC_Save() and Cy_CSDIDAC_Restore() functions are used
* instead of the Cy_CSDIDAC_DeInit() and Cy_CSDIDAC_Init() functions.
*
* \param context
* The pointer to the CSDIDAC context structure \ref cy_stc_csdidac_context_t.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS           - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM         - The input pointer is NULL or an invalid
*                                  parameter is passed.
* * CY_CSDIDAC_HW_LOCKED         - The CSD HW block is already in use by other
*                                  middleware.
* * CY_CSDIDAC_HW_FAILURE        - A CSD HW block failure.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_DeInit(cy_stc_csdidac_context_t * context)
{
    return (Cy_CSDIDAC_Save(context));
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_WriteConfig
****************************************************************************//**
*
* Updates the CSDIDAC middleware with the desired configuration.
*
* This function sets the desired CSDIDAC middleware configuration.
* The function performs the following:
* * Verifies the input parameters
* * Verifies whether the CSD HW block is captured by the CSDIDAC middleware
*   and that there are no active IDAC outputs.
* * Initializes the CSD HW block registers with data passed through the
*   config parameter of this function if the above verifications are
*   successful.
* * Returns the status code regarding the function execution result.
*
* \param config
* The pointer to the CSDIDAC configuration structure to be updated.
*
* \param context
* The pointer to the CSDIDAC context structure \ref cy_stc_csdidac_context_t.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS           - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM         - The input pointer is NULL or an invalid
*                                  parameter is passed.
* * CY_CSDIDAC_HW_BUSY           - Any IDAC output is enabled. The operation
*                                  cannot be completed.
* * CY_CSDIDAC_HW_LOCKED         - The CSD HW block is already in use by other
*                                  middleware.
* * CY_CSDIDAC_BAD_CONFIGURATION - The CSDIDAC configuration structure
*                                  initialization issue.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_WriteConfig(
                const cy_stc_csdidac_config_t * config,
                cy_stc_csdidac_context_t * context)
{
    cy_en_csdidac_status_t result = CY_CSDIDAC_BAD_PARAM;
    uint32_t tmpRegValue = CY_CSDIDAC_SW_REFGEN_SEL_IBCB_ON;

    if ((NULL != config) && (NULL != context))
    {
        if(true == Cy_CSDIDAC_IsIdacConfigValid(config))
        {
            if (CY_CSD_IDAC_KEY == Cy_CSD_GetLockStatus(context->cfgCopy.base, context->cfgCopy.csdCxtPtr))
            {
                if ((CY_CSDIDAC_DISABLE == context->channelStateA) && (CY_CSDIDAC_DISABLE == context->channelStateB))
                {
                    /* Copies the configuration structure to the context. */
                    context->cfgCopy = *config;

                    /* Disconnects the IDACs from AMUX buses. */
                    Cy_CSD_WriteReg(context->cfgCopy.base, CY_CSD_REG_OFFSET_SW_BYP_SEL, 0u);

                    /* Closes the IAIB switch if IDACs joined. */
                    if ((CY_CSDIDAC_JOIN == context->cfgCopy.configA) || (CY_CSDIDAC_JOIN == context->cfgCopy.configB))
                    {
                        tmpRegValue |= CY_CSDIDAC_SW_REFGEN_SEL_IAIB_ON;
                    }
                    Cy_CSD_WriteReg(context->cfgCopy.base, CY_CSD_REG_OFFSET_SW_REFGEN_SEL, tmpRegValue);
                    result = CY_CSDIDAC_SUCCESS;
                }
                else
                {
                    result = CY_CSDIDAC_HW_BUSY;
                }
            }
            else
            {
                result = CY_CSDIDAC_HW_LOCKED;
            }
        }
        else
        {
            result = CY_CSDIDAC_BAD_CONFIGURATION;
        }
    }

    return (result);
}


