RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/csdidac/cy_csdidac.c
/*******************************************************************************
* Function Name: Cy_CSDIDAC_Wakeup
****************************************************************************//**
*
* Provides a delay required for the CSD HW block to settle after a wakeup
* from CPU / System Deep Sleep.
*
* This function provides a delay after exiting CPU / System Deep Sleep.
* After the CSD HW block has been powered off, an extra delay is required
* to establish the CSD HW block correct operation.
*
* \param context
* The pointer to the CSDIDAC context structure \ref cy_stc_csdidac_context_t.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS   - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM - The input pointer is NULL.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_Wakeup(const cy_stc_csdidac_context_t * context)
{
    cy_en_csdidac_status_t result = CY_CSDIDAC_BAD_PARAM;

    if (NULL != context)
    {
        Cy_SysLib_DelayUs((uint16_t)context->cfgCopy.csdInitTime);
        result = CY_CSDIDAC_SUCCESS;
    }

    return (result);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_DeepSleepCallback
****************************************************************************//**
*
* The callback function to prepare the CSDIDAC before entering CPU / System Deep Sleep.
*
* This function handles CPU active to CPU / System Deep Sleep power mode transition
* for the CSDIDAC middleware.
* Calling this function directly from the application program is not
* recommended. Instead, Cy_SysPm_CpuEnterDeepSleep() is used for CPU active to
* CPU / System Deep Sleep power mode transition of the device.
* \note
* After the CPU Deep Sleep transition, the device automatically goes
* to System Deep Sleep if all conditions are fulfilled: another core is
* in CPU Deep Sleep, all the peripherals are ready to System Deep Sleep, etc.
* (see details in the device TRM).
*
* For the CSDIDAC middleware correct operation during CPU active to
* CPU / System Deep Sleep mode transition, a callback to this API is registered
* using the Cy_SysPm_RegisterCallback() function with CY_SYSPM_DEEPSLEEP
* type. After the callback is registered, this function is called by the
* Cy_SysPm_CpuEnterDeepSleep() function to prepare the middleware for the device
* power mode transition.
*
* When this function is called with CY_SYSPM_CHECK_READY as an input, this
* function returns CY_SYSPM_SUCCESS if no output is enabled. Otherwise,
* CY_SYSPM_FAIL is returned. If CY_SYSPM_FAIL status is returned, a device
* cannot change power mode. To provide such a transition, the application
* program disables all the enabled IDAC outputs.
*
* \param callbackParams
* Refer to the description of the cy_stc_syspm_callback_params_t type in the
* Peripheral Driver Library documentation.
*
* \param mode
* Refer to the description of the cy_en_syspm_callback_mode_t type in the
* Peripheral Driver Library documentation.
*
* \return
* Returns the status of the operation requested by the mode parameter:
* * CY_SYSPM_SUCCESS  - CPU / System Deep Sleep power mode can be entered.
* * CY_SYSPM_FAIL     - CPU / System Deep Sleep power mode cannot be entered.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_CSDIDAC_DeepSleepCallback(
                cy_stc_syspm_callback_params_t * callbackParams,
                cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;
    cy_stc_csdidac_context_t * csdIdacCxt = (cy_stc_csdidac_context_t *) callbackParams->context;

    if (CY_SYSPM_CHECK_READY == mode)
    { /* Actions before entering CPU / System Deep Sleep */
        if ((CY_CSD_IDAC_KEY == Cy_CSD_GetLockStatus(csdIdacCxt->cfgCopy.base, csdIdacCxt->cfgCopy.csdCxtPtr)) &&
           ((CY_CSDIDAC_ENABLE == csdIdacCxt->channelStateA) || (CY_CSDIDAC_ENABLE == csdIdacCxt->channelStateB)))
        {
            retVal = CY_SYSPM_FAIL;
        }
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_Save
****************************************************************************//**
*
* Saves the state of the CSDIDAC middleware so the functionality can be
* restored later.
*
* This function, along with Cy_CSDIDAC_Restore(), is specifically designed
* to support time multiplexing of the CSD HW block between multiple
* middleware. When the CSD HW block is shared by more than one middleware,
* this function can be used to save the current state of the CSDIDAC middleware
* and the CSD HW block prior to releasing the CSD HW block for use by other
* middleware.
*
* This function performs the following operations:
* * Saves the current configuration of the CSD HW block and CSDIDAC middleware.
* * Configures the output pins to the default state and disconnects them from
* the CSD HW block. Releases the CSD HW block.
*
* \param context
* The pointer to the CSDIDAC context structure \ref cy_stc_csdidac_context_t.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS      - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM    - The input pointer is NULL or an invalid parameter
*                             is passed. The operation is not completed.
* * CY_CSDIDAC_HW_LOCKED    - The CSD HW block is already in use by other middleware.
*                             The CSDIDAC middleware cannot save the state
*                             without the initialization or restore operation.
* * CY_CSDIDAC_HW_FAILURE   - A CSD HW block failure.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_Save(cy_stc_csdidac_context_t * context)
{
    cy_en_csdidac_status_t result = CY_CSDIDAC_BAD_PARAM;
    cy_en_csd_status_t initStatus = CY_CSD_LOCKED;

    if (NULL != context)
    {
        if (CY_CSD_IDAC_KEY == Cy_CSD_GetLockStatus(context->cfgCopy.base, context->cfgCopy.csdCxtPtr))
        {
            /* Disconnects the output channels pins from analog buses. */
            Cy_CSDIDAC_DisconnectChannelA(context);
            Cy_CSDIDAC_DisconnectChannelB(context);

