RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/csdidac/cy_csdidac.c
            /* Releases the HW CSD block. */
            initStatus = Cy_CSD_DeInit(context->cfgCopy.base, CY_CSD_IDAC_KEY, context->cfgCopy.csdCxtPtr);

            if (CY_CSD_SUCCESS == initStatus)
            {
                result = CY_CSDIDAC_SUCCESS;
            }
            else
            {
                result = CY_CSDIDAC_HW_FAILURE;
            }
        }
        else
        {
            result = CY_CSDIDAC_HW_LOCKED;
        }
    }

    return (result);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_Restore
****************************************************************************//**
*
* Resumes the middleware operation if the Cy_CSDIDAC_Save() function was
* called previously.
*
* This function, along with the Cy_CSDIDAC_Save() function, is specifically
* designed to support the CSD HW block time-multiplexing
* among multiple middleware. When the CSD HW block is shared by more than one
* middleware, this function can be used to restore the CSD HW block previous
* state and the CSDIDAC middleware saved using the Cy_CSDIDAC_Save() function.
*
* This function performs the Cy_CSDIDAC_Init() function, part tasks
* namely captures the CSD HW block. Use the Cy_CSDIDAC_Save() and
* Cy_CSDIDAC_Restore() functions to implement Time-multiplexed mode
* instead of using the Cy_CSDIDAC_DeInit() and Cy_CSDIDAC_Init() functions.
*
* \param context
* The pointer to the CSDIDAC middleware context
* structure \ref cy_stc_csdidac_context_t.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS           - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM         - The input pointer is NULL or an invalid
*                                  parameter is passed.
* * CY_CSDIDAC_HW_LOCKED         - The CSD HW block is already in use by
*                                  another middleware.
* * CY_CSDIDAC_HW_FAILURE        - The CSD HW block failure.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_Restore(cy_stc_csdidac_context_t * context)
{
    uint32_t watchdogCounter;

    cy_en_csdidac_status_t result = CY_CSDIDAC_HW_FAILURE;
    cy_en_csd_key_t mvKey;
    cy_en_csd_status_t initStatus = CY_CSD_LOCKED;
    cy_stc_csd_config_t csdCfg = CY_CSDIDAC_CSD_CONFIG_DEFAULT;

    /* The number of cycles of one for() loop. */
    const uint32_t cyclesPerLoop = 5u;
    /* The timeout in microseconds */
    const uint32_t watchdogTimeoutUs = 10000u;

    if (NULL != context)
    {
        CSD_Type * ptrCsdBaseAdd = context->cfgCopy.base;
        cy_stc_csd_context_t * ptrCsdCxt = context->cfgCopy.csdCxtPtr;
        /* Closes the IAIB switch if IDACs joined */
        if ((CY_CSDIDAC_JOIN == context->cfgCopy.configA) || (CY_CSDIDAC_JOIN == context->cfgCopy.configB))
        {
            csdCfg.swRefgenSel |= CY_CSDIDAC_SW_REFGEN_SEL_IAIB_ON;
        }

        /* Gets the CSD HW block status. */
        mvKey = Cy_CSD_GetLockStatus(ptrCsdBaseAdd, ptrCsdCxt);
        if(CY_CSD_NONE_KEY == mvKey)
        {
            Cy_CSD_WriteReg(ptrCsdBaseAdd, CY_CSD_REG_OFFSET_INTR_MASK, CY_CSDIDAC_CSD_INTR_MASK_CLEAR_MSK);
            Cy_CSD_WriteReg(ptrCsdBaseAdd, CY_CSD_REG_OFFSET_SEQ_START, CY_CSDIDAC_FSM_ABORT);

            /* Initializes the Watchdog Counter to prevent a hang. */
            watchdogCounter = (watchdogTimeoutUs * (context->cfgCopy.cpuClk / CY_CSDIDAC_CONST_1000000)) / cyclesPerLoop;
            do
            {
                initStatus = Cy_CSD_GetConversionStatus(ptrCsdBaseAdd, ptrCsdCxt);
                watchdogCounter--;
            }
            while((CY_CSD_BUSY == initStatus) && (0u != watchdogCounter));

            if (CY_CSD_SUCCESS == initStatus)
            {
                /* Captures the CSD HW block for the IDAC functionality. */
                initStatus = Cy_CSD_Init(ptrCsdBaseAdd, &csdCfg, CY_CSD_IDAC_KEY, ptrCsdCxt);

                if(CY_CSD_SUCCESS == initStatus)
                {
                    result = CY_CSDIDAC_SUCCESS;
                }
            }
        }
        else
        {
            result = CY_CSDIDAC_HW_LOCKED;
        }
    }
    else
    {
        result = CY_CSDIDAC_BAD_PARAM;
    }
    return (result);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_OutputEnable
****************************************************************************//**
*
* Enables an IDAC output with a specified current.
*
* This function performs the following:
* * Verifies the input parameters.
* * Identifies LSB and IDAC code required to generate the specified
*   output current and configures the CSD HW block accordingly.
* * Configures and enables the CSDIDAC specified output and returns
*   the status code.
*
* \param ch
* The CSDIDAC supports two outputs (A and B), this parameter
* specifies the output to be enabled.
*
* \param current
* A current value for an IDAC output in nA with a sign. If the parameter is
* positive, a sourcing current is generated. If the parameter is
* negative, the sinking current is generated. The middleware
* identifies LSB and code values required to achieve the specified output
* current. The middleware chooses the minimum possible LSB to generate the
* current to minimize a quantization error. NOTE! the quantization
* error in the output current based on the LSB size (37.5/
* 75/300/600/2400/4800 nA). For instance, if this function
* is called to set 123456 nA, the actual output current is rounded
* to the nearest value of multiple to 2400 nA, i.e 122400 nA. The absolute
* value of this parameter is in the range from 0x00u
* to \ref CY_CSDIDAC_MAX_CURRENT_NA.
*
* \param context
* The pointer to the CSDIDAC middleware context
* structure \ref cy_stc_csdidac_context_t.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS    - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM  - The input pointer is NULL or an invalid parameter
*                           is passed.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_OutputEnable(
                cy_en_csdidac_choice_t ch,
                int32_t current,
                cy_stc_csdidac_context_t * context)
{
    cy_en_csdidac_status_t retVal = CY_CSDIDAC_BAD_PARAM;
    cy_en_csdidac_polarity_t polarity= CY_CSDIDAC_SOURCE;
    cy_en_csdidac_lsb_t lsbIndex;
    uint32_t absCurrent = (0 > current) ? (uint32_t)(-current) : (uint32_t)current;
    uint32_t code;

    if((NULL != context) && (CY_CSDIDAC_MAX_CURRENT_NA >= absCurrent))
    {
        if(true == Cy_CSDIDAC_IsIdacChoiceValid(ch, context->cfgCopy.configA, context->cfgCopy.configB))
        {
            /* Chooses the desired current polarity */
            if (0 > current)
            {
                polarity = CY_CSDIDAC_SINK;
            }
            /* Converts absCurrent to pA */
            absCurrent *= CY_CSDIDAC_CONST_1000;
            /* Chooses IDAC LSB and calculates the IDAC code */
            if (absCurrent < CY_CSDIDAC_LSB_37_MAX_CURRENT)
            {
                lsbIndex = CY_CSDIDAC_LSB_37_IDX;
                code = absCurrent / CY_CSDIDAC_LSB_37;
            }
            else if (absCurrent < CY_CSDIDAC_LSB_75_MAX_CURRENT)
            {
                lsbIndex = CY_CSDIDAC_LSB_75_IDX;
                code = absCurrent / CY_CSDIDAC_LSB_75;
            }
            else if (absCurrent < CY_CSDIDAC_LSB_300_MAX_CURRENT)
            {
                lsbIndex = CY_CSDIDAC_LSB_300_IDX;
                code = absCurrent / CY_CSDIDAC_LSB_300;
            }
            else if (absCurrent < CY_CSDIDAC_LSB_600_MAX_CURRENT)
            {
                lsbIndex = CY_CSDIDAC_LSB_600_IDX;
                code = absCurrent / CY_CSDIDAC_LSB_600;
            }
            else if(absCurrent < CY_CSDIDAC_LSB_2400_MAX_CURRENT)
            {
                lsbIndex = CY_CSDIDAC_LSB_2400_IDX;
                code = absCurrent / CY_CSDIDAC_LSB_2400;
            }
            else
            {
                lsbIndex = CY_CSDIDAC_LSB_4800_IDX;
                code = absCurrent / CY_CSDIDAC_LSB_4800;
            }
            if (code > CY_CSDIDAC_MAX_CODE)
            {
                code = CY_CSDIDAC_MAX_CODE;
            }

            /* Sets the desired IDAC(s) polarity, LSB and code in the CSD block and connects output(s). */
            retVal = Cy_CSDIDAC_OutputEnableExt(ch, polarity, lsbIndex, code, context);
        }
    }

    return (retVal);
}


