RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/csdidac/cy_csdidac.c
/*******************************************************************************
* Function Name: Cy_CSDIDAC_OutputEnableExt
****************************************************************************//**
*
* Enables an IDAC output with the specified polarity, LSB, and IDAC code.
*
* This function performs the following:
* * Verifies the input parameters.
* * Configures and enables the specified output of CSDIDAC and returns the
*   status code.
*
* \param outputCh
* CSDIDAC supports two outputs, this parameter specifies the output to
* be enabled.
*
* \param polarity
* The polarity to be set for the specified IDAC.
*
* \param lsbIndex
* The LSB to be set for the specified IDAC.
*
* \param idacCode
* The code value for the specified IDAC in the range from 0 u
* to \ref CY_CSDIDAC_MAX_CODE.
*
* \param context
* The pointer to the CSDIDAC middleware context
* structure \ref cy_stc_csdidac_context_t.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS    - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM  - The input pointer is NULL or an invalid parameter
*                           is passed.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_OutputEnableExt(
                cy_en_csdidac_choice_t outputCh,
                cy_en_csdidac_polarity_t polarity,
                cy_en_csdidac_lsb_t lsbIndex,
                uint32_t idacCode,
                cy_stc_csdidac_context_t * context)
{
    uint32_t idacRegValue;
    uint32_t  interruptState;
    cy_en_csdidac_status_t retVal = CY_CSDIDAC_BAD_PARAM;

    if((NULL != context) && (CY_CSDIDAC_MAX_CODE >= idacCode))
    {
        CSD_Type * ptrCsdBaseAdd = context->cfgCopy.base;
        if((true == Cy_CSDIDAC_IsIdacChoiceValid(outputCh, context->cfgCopy.configA, context->cfgCopy.configB)) &&
           (true == Cy_CSDIDAC_IsIdacPolarityValid(polarity)) &&
           (true == Cy_CSDIDAC_IsIdacLsbValid(lsbIndex)))
         {
            idacRegValue = idacCode | (((uint32_t)polarity) << CY_CSDIDAC_POLARITY_POS);
            /* Sets IDAC LSB. The LSB value equals lsbIndex divided by 2 */
            idacRegValue |= ((((uint32_t)lsbIndex) >> 1uL) << CY_CSDIDAC_LSB_POS);
            /* Sets the IDAC leg1 enabling bit */
            idacRegValue |= ((uint32_t)CY_CSDIDAC_LEG1_EN_MASK);
            /* Sets the IDAC leg2 enabling bit if the lsbIndex is even. */
            if (0u != (lsbIndex % CY_CSDIDAC_CONST_2))
            {
                idacRegValue |= ((uint32_t)CY_CSDIDAC_LEG2_EN_MASK);
            }

            interruptState = Cy_SysLib_EnterCriticalSection();
            if (((CY_CSDIDAC_A == outputCh) || (CY_CSDIDAC_AB == outputCh)) &&
                (CY_CSDIDAC_DISABLED != context->cfgCopy.configA))
            {
                /* Sets the IDAC A polarity, LSB and code in the context structure. */
                context->polarityA = polarity;
                context->lsbA = lsbIndex;
                context->codeA = (uint8_t)idacCode;
                context->channelStateA = CY_CSDIDAC_ENABLE;
                /* Connects the IDAC A output. */
                Cy_CSDIDAC_ConnectChannelA(context);
                /* A connected IDAC B output must be available if the IDAC A output is joined to it. */
                if (CY_CSDIDAC_JOIN == context->cfgCopy.configA)
                {
                    Cy_CSDIDAC_ConnectChannelB(context);
                }
                Cy_CSD_WriteReg(ptrCsdBaseAdd, CY_CSD_REG_OFFSET_IDACA, idacRegValue);

                retVal = CY_CSDIDAC_SUCCESS;
            }

            if (((CY_CSDIDAC_B == outputCh) || (CY_CSDIDAC_AB == outputCh)) &&
                (CY_CSDIDAC_DISABLED != context->cfgCopy.configB))
            {
                /* Sets the IDAC B polarity, LSB and code in the context structure. */
                context->polarityB = polarity;
                context->lsbB = lsbIndex;
                context->codeB = (uint8_t)idacCode;
                context->channelStateB = CY_CSDIDAC_ENABLE;
                /* Connects the IDAC B output. */
                Cy_CSDIDAC_ConnectChannelB(context);
                /* A connected IDAC A output must be available if the IDAC B output is joined to it */
                if (CY_CSDIDAC_JOIN == context->cfgCopy.configB)
                {
                    Cy_CSDIDAC_ConnectChannelA(context);
                }
                Cy_CSD_WriteReg(ptrCsdBaseAdd, CY_CSD_REG_OFFSET_IDACB, idacRegValue);

                retVal = CY_CSDIDAC_SUCCESS;
            }
            Cy_SysLib_ExitCriticalSection(interruptState);
        }
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_ConnectChannelA
****************************************************************************//**
*
* Connects an IDAC A output as specified by the configuration.
*
* \param context
* The pointer to the CSDIDAC middleware context
* structure \ref cy_stc_csdidac_context_t.
*
*******************************************************************************/
static void Cy_CSDIDAC_ConnectChannelA(
                cy_stc_csdidac_context_t * context)
{
    /* Closes the bypass A switch to feed output current to AMuxBusA. */
    if ((CY_CSDIDAC_GPIO == context->cfgCopy.configA) ||  (CY_CSDIDAC_AMUX == context->cfgCopy.configA))
    {
        Cy_CSD_SetBits(context->cfgCopy.base, CY_CSD_REG_OFFSET_SW_BYP_SEL, CY_CSDIDAC_SW_BYPA_ENABLE);
    }
    /* Configures port pin, if it is enabled. */
    if ((CY_CSDIDAC_GPIO == context->cfgCopy.configA) && (NULL != context->cfgCopy.ptrPinA))
    {
        /* Update port configuration register (drive mode) to High-Z Analog */
        Cy_GPIO_SetDrivemode(context->cfgCopy.ptrPinA->ioPcPtr, (uint32_t)context->cfgCopy.ptrPinA->pin, CY_GPIO_DM_ANALOG);
        /* Connect the selected port to AMuxBusA */
        Cy_GPIO_SetHSIOM(context->cfgCopy.ptrPinA->ioPcPtr, (uint32_t)context->cfgCopy.ptrPinA->pin, HSIOM_SEL_AMUXA);
    }
}


