RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/csdidac/cy_csdidac.c
/*******************************************************************************
* Function Name: Cy_CSDIDAC_ConnectChannelB
****************************************************************************//**
*
* Connects an IDAC B output as specified by the configuration.
*
* \param context
* The pointer to the CSDIDAC middleware context
* structure \ref cy_stc_csdidac_context_t.
*
*******************************************************************************/
static void Cy_CSDIDAC_ConnectChannelB(
                cy_stc_csdidac_context_t * context)
{
    /* Closes the bypass B switch to feed an output current to AMuxBusB. */
    if ((CY_CSDIDAC_GPIO == context->cfgCopy.configB) ||  (CY_CSDIDAC_AMUX == context->cfgCopy.configB))
    {
        Cy_CSD_SetBits(context->cfgCopy.base, CY_CSD_REG_OFFSET_SW_BYP_SEL, CY_CSDIDAC_SW_BYPB_ENABLE);
    }
    /* Configures port pin, if it is enabled. */
    if (CY_CSDIDAC_GPIO == context->cfgCopy.configB)
    {
        /* Update port configuration register (drive mode) to High-Z Analog */
        Cy_GPIO_SetDrivemode(context->cfgCopy.ptrPinB->ioPcPtr, (uint32_t)context->cfgCopy.ptrPinB->pin, CY_GPIO_DM_ANALOG);
        /* Connect the selected port to AMuxBusB */
        Cy_GPIO_SetHSIOM(context->cfgCopy.ptrPinB->ioPcPtr, (uint32_t)context->cfgCopy.ptrPinB->pin, HSIOM_SEL_AMUXB);
    }
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_DisconnectChannelA
****************************************************************************//**
*
* Disconnects the output channel A pin, if it is configured.
*
* \param context
* The pointer to the CSDIDAC middleware context
* structure \ref cy_stc_csdidac_context_t.
*
*******************************************************************************/
static void Cy_CSDIDAC_DisconnectChannelA(cy_stc_csdidac_context_t * context)
{
    /* Disables the desired IDAC. */
    context->channelStateA = CY_CSDIDAC_DISABLE;
    Cy_CSD_WriteReg(context->cfgCopy.base, CY_CSD_REG_OFFSET_IDACA, 0uL);
    /* Opens the bypass A switch to disconnect an output current from AMuxBusA. */
    if ((CY_CSDIDAC_GPIO == context->cfgCopy.configA) ||  (CY_CSDIDAC_AMUX == context->cfgCopy.configA))
    {
        Cy_CSD_ClrBits(context->cfgCopy.base, CY_CSD_REG_OFFSET_SW_BYP_SEL, CY_CSDIDAC_SW_BYPA_ENABLE);
    }
    /* Disconnects AMuxBusA from the selected pin, if it is configured. */
    if ((CY_CSDIDAC_GPIO == context->cfgCopy.configA) && (NULL != context->cfgCopy.ptrPinA))
    {
        Cy_GPIO_SetHSIOM(context->cfgCopy.ptrPinA->ioPcPtr, (uint32_t)context->cfgCopy.ptrPinA->pin, HSIOM_SEL_GPIO);
    }
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_DisconnectChannelB
****************************************************************************//**
*
* Disconnects the output channel B pin, if it is configured.
*
* \param context
* The pointer to the CSDIDAC middleware context
* structure \ref cy_stc_csdidac_context_t.
*
*******************************************************************************/
static void Cy_CSDIDAC_DisconnectChannelB(cy_stc_csdidac_context_t * context)
{
    /* Disables the desired IDAC. */
    context->channelStateB = CY_CSDIDAC_DISABLE;
    Cy_CSD_WriteReg(context->cfgCopy.base, CY_CSD_REG_OFFSET_IDACB, 0uL);
    /* Opens the bypass B switch to disconnect an output current from AMuxBusB. */
    if ((CY_CSDIDAC_GPIO == context->cfgCopy.configB) ||  (CY_CSDIDAC_AMUX == context->cfgCopy.configB))
    {
        Cy_CSD_ClrBits(context->cfgCopy.base, CY_CSD_REG_OFFSET_SW_BYP_SEL, CY_CSDIDAC_SW_BYPB_ENABLE);
    }
    /* Disconnects AMuxBusB from the selected pin, if it is configured. */
    if ((CY_CSDIDAC_GPIO == context->cfgCopy.configB) && (NULL != context->cfgCopy.ptrPinB))
    {
        Cy_GPIO_SetHSIOM(context->cfgCopy.ptrPinB->ioPcPtr, (uint32_t)context->cfgCopy.ptrPinB->pin, HSIOM_SEL_GPIO);
    }
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_OutputDisable
****************************************************************************//**
*
* Disables a specified IDAC output.
*
* The function performs the following:
* * Verifies the input parameters.
* * Disables the specified output of CSDIDAC and returns the status code.
*
* \param ch
* The channel to disconnect.
*
* \param context
* The pointer to the CSDIDAC middleware context
* structure \ref cy_stc_csdidac_context_t.
*
* \return
* The function returns the status of its operation.
* * CY_CSDIDAC_SUCCESS    - The operation is performed successfully.
* * CY_CSDIDAC_BAD_PARAM  - The input pointer is NULL or an invalid parameter
*                           is passed.
*
*******************************************************************************/
cy_en_csdidac_status_t Cy_CSDIDAC_OutputDisable(
                cy_en_csdidac_choice_t ch,
                cy_stc_csdidac_context_t * context)
{
    cy_en_csdidac_status_t retVal = CY_CSDIDAC_BAD_PARAM;

    if(NULL != context)
    {
        if ((CY_CSDIDAC_A == ch) || (CY_CSDIDAC_AB == ch))
        {
            Cy_CSDIDAC_DisconnectChannelA(context);
            retVal = CY_CSDIDAC_SUCCESS;
        }
        if ((CY_CSDIDAC_B == ch) || (CY_CSDIDAC_AB == ch))
        {
            Cy_CSDIDAC_DisconnectChannelB(context);
            retVal = CY_CSDIDAC_SUCCESS;
        }
    }

    return (retVal);
}

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2)) */


/* [] END OF FILE */
